using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DZ_5
{
    internal class Emploes : ObservableCollection<Emploee>
    {
        public Emploes()
        {
            Add(new Emploee("Кирилл", "Василиевич", "Мармышкин", 1984, "Высшее", "Англиский", "Свободный разговорный", "Могу хакнуть пентагон", 10, "Надежность"));
            Add(new Emploee("Элеонора", "Андреевна", "Вершинская", 1991, "Среднее специальное", "Японский", "Со словарем", "Уверенный пользователь", 8, "Коммуникабельность"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
            Add(new Emploee("Петруччо", "Ашотович", "Мармадюк", 2003, "Среднее", "Русский", "Со словарем", "Что это?", 1, "Папа директор"));
        }
    }
}
